<template>
  <div>
    <el-dialog title="用户协议" :visible="dialogUserProtocol" center :before-close="agreeBtn">
      <div class="user-protocol">
        <div class="user-protocol-content">
          <h3 class="text-center fs-20">浩海通达平台商户服务协议</h3>
          <br>
          <div>成都浩海通达科技有限公司（以下简称“浩海通达”）作为【91LNG】智慧运贸平台（以下简称“平台”）的开发者、所有权人和经营者，根据货运物流经营者（以下简称“商户”）及用户的需求向使用平台（包括PC版、手机版、APP及其他形式的载体，浩海通达可根据实际情况调整。）的商户和用户提供信息中介服务；平台根据用户发出的货运需求信息，经过后台大数据信息处理，通过平台端口提供可使用的商户信息，并由最终匹配成功的商户向用户提供线下运输服务。</div>
          <div class="c-black">浩海通达仅根据交易双方的承运需求通过平台提供信息中介服务，商户使用平台的过程中的商业和法律风险（包括但不限于交易对手的违约和侵权责任风险）由商户自行承担，与浩海通达无关；使用平台有关服务适用本商户服务协议（以下简称“协议”）的相关约定。</div>
          <div class="c-black">在注册成为平台入驻商户前，请仔细阅读本协议（尤其是粗体标注部分）；如果商户对本协议的条款有疑问的，请通过浩海通达客服渠道进行询问，浩海通达将向商户解释条款内容。任何人/单位一旦在平台上进行注册即视为已充分阅读、理解并接受本协议的所有条款，并同意相关条款对其具有法律约束力。如果商户不同意本协议的任意内容，或者无法准确理解浩海通达对条款的解释，请不要进行注册并使用本协议项下的服务，否则，表示商户已接受了以下所述的条款和条件，同意受本协议约束。届时商户无权以未阅读本协议的内容或者未获得浩海通达对问询的解答等理由，主张本协议无效，或要求撤销本协议。成都浩海通达科技有限公司对于本协议内容拥有最终解释权和修订权。</div>
          <h4>一、协议内容及生效</h4>
          <div>商户在使用平台的各项服务时承诺接受并遵守本协议。浩海通达有权根据业务发展需要不时地修订本协议及发布于平台中的使用规则，或制定新的平台规则、附属文件；该等修订和新制定内容，自其在平台发布时起即自动生效，成为本协议的一部分。如商户不同意本协议、相关修订或新制定内容，必须立即停止使用平台服务，并以书面方式通知浩海通达终止本协议。商户继续登录平台或继续使用平台服务，即表示商户接受本协议及其修订、新增的内容并受其约束。</div>
          <h4>二、合作模式</h4>
          <div>1.商户依照本协议约定通过平台与用户直接进行交易，向用户提供货物运输服务。商户应依法经营，盈亏自负，独立承担法律责任和风险。商户通过平台进行交易的过程中与用户发生纠纷的，由商户自行处理并承担相应责任，与浩海通达无关。</div>
          <div>2.商户经浩海通达许可后，方可在平台上展示和推销其服务。浩海通达可通过向商户发送书面通知的形式，决定调整许可商户展示和推销的服务的种类。如商户需要增加其所展示的服务的种类，应当经过浩海通达书面批准。</div>
          <div><span class="c-black">3.浩海通达目前暂不就平台服务向商户收取服务费用，但商户同意浩海通达有权随时制定费用结算标准向商户进行收费，且该等收费结算标准有可能会不时调整并自调整之日起生效。</span></div>
          <h4>三、经营资质及证明文件提交</h4>
          <div>1. 商户保证其为根据中国法律登记、注册并有效存续的股份有限公司或有限责任公司，具有签订和履行本协议的能力，并具有经营本协议项下所有服务的合法资质。为证明商户的上述经营资质，商户应当在注册平台账户时向浩海通达提交下列文件：</div>
          <div>a) 主体资格证书：包括但不限于工商营业执照及法定代表人身份证复印件；</div>
          <div>b) 特定行业资质：指商户在平台上所展示的服务，根据国家法律、法规、规章、规范性文件等要求，必须具备的行业资质证书及法定文件，包括但不限于包含危险品运输事项的道路运输经营许可证或道路危险货物运输许可证、车辆登记证及相关信息、保险公司投保协议、保险单、从业人员的资格证等；</div>
          <div>c) 浩海通达可能要求商户提供的其他用以证明其经营资质和能力的文件，包括但不限于地址、有效联系方式等的证明文件。</div>
          <div>2. 证明文件提交</div>
          <div>a) 商户必须根据浩海通达要求，向浩海通达提供证明文件并配合浩海通达核验相关的文件。</div>
          <div>b) 如果商户的证明文件有更新或变更，应将更新或变更后的文件自更新或变更之日起的2个自然日内依照本条第一款规定的形式提供给浩海通达。如商户提供虚假、失效文件，或未及时提供更新或变更后的文件，或浩海通达认为商户证明文件存有其他可能影响商户订立及履行本协议的情形，浩海通达有权解除本协议并注销商户的账户，商户还应承担由此产生的法律责任。</div>
          <div>c) 浩海通达有权要求商户提供浩海通达认为有必要的更多的证明文件，商户须按浩海通达的要求提供。如商户不能提供或不能按时提供该等证明文件，则浩海通达有权立即终止审查商户使用平台的申请。</div>
          <div>3. 文件有效性保证</div>
          <div>商户保证其向浩海通达提供的全部证明文件真实、准确、完整、有效、合法，且不存在超过时效问题<span class="c-black">（即商户保证其所有证明文件在整个合同履行期间都处于有效期内，商户在其任何证明文件有效期即将届满前的30日内应当向浩海通达作出书面保证，保证其已经开始就相关证明文件的更新或延期向政府主管机关进行了申请；如截止其相关文件有效期届满前的5日商户仍未向浩海通达提交更新或延期后的证明文件，浩海通达有权暂停为其提供服务）</span>；如因商户资质证明文件虚假或失效等原因而发生纠纷或被相关国家主管机关处罚，商户应当独立承担全部责任；如因此给浩海通达造成损失的，商户应当赔偿浩海通达全部损失。</div>
          <h4>四、声明和保证</h4>
          <div>1. 商户完成注册流程后将获得浩海通达提供的平台账户用户名，商户应当自行设定账户密码。商户同意妥善保管其用户名及密码等与其使用平台相关的账户信息，未经浩海通达书面同意不得以任何形式转让或授权他人使用自己的账户，并对利用平台相关的账户信息所进行的一切活动负全部责任。</div>
          <div>2. 商户的账户信息如发生任何安全问题（包括但不限于遭到未获授权的使用等），商户应立即书面通知浩海通达，以便浩海通达采取及时的处理或应对措施。如果因商户怠于通知浩海通达原因，造成商户损失的，商户不得因此追究浩海通达责任。</div>
          <div>3. 商户承诺，其发布于平台的所有信息（包括但不限于文字、图片等）均真实、准确、完整、有效、合法，符合相关法律法规、本协议及平台规则的要求。<span class="c-black">商户应当在其从事经营活动的主页面醒目位置公开营业执照登载的信息或者其营业执照的电子链接标识。</span></div>
          <div>4. 商户保证仅为其自身的服务进行推介而使用平台服务，其身份为平台账户的真实使用者及管理者，对其发布于平台的交易信息中所涉服务有合法的权利，商户已取得该服务所需要的各项审批、许可、认证、检测等法律文件，且推介、销售和服务等行为均未侵犯任何第三方的任何合法权利。</div>
          <div>5. 商户承诺所提供的服务价格合理，与实际价值相符，且除其他网络平台补贴销售等特殊原因外，服务价格不得高于商户同期在其自营网站发布的同一地区的服务价格。</div>
          <div>6. 商户承诺其拥有合法的权利和资格向平台上传有关服务的信息，且该等行为未对任何第三方合法权益（包括但不限于第三方知识产权、物权等）构成侵害；如因商户前述行为导致浩海通达遭受任何第三方提起的索赔、诉讼或行政调查，商户将承担全部责任，并赔偿浩海通达所遭受的损失。</div>
          <div>7. 商户保证维护平台的良好声誉和浩海通达企业形象，不做出任何有损于平台品牌形象和声誉的言论及行动（包括但不限于未经浩海通达书面同意在其经营活动中使用与平台相关的文字、图案或者标识）。如浩海通达发现商户有诋毁或其他损害平台声誉的行为的，浩海通达有权终止本协议，并将视情节追究商户法律责任。</div>
          <div>8. 商户承诺其传输到平台上的内容应当符合系统要求，承诺不包含电脑病毒等恶意程序，且文件大小在系统可容纳的范围之内。</div>
          <div>9. 商户确认知晓并同意：浩海通达在本协议中仅向商户提供中介平台，对与商户提供的服务相关的全部内容不承担任何责任。与商户相关的安全、违约和售后服务、侵权责任等全部事项，以及由该等事项引发的对用户或第三方的责任，全部由商户自行承担。</div>
          <div>10. 商户保证，对其在平台上推介的交易应依法为用户开具发票等服务凭证，相关税收及费用应按国家相关规定由商户自行承担。</div>
          <div>11. 商户保证其在使用平台过程中所实施的所有行为均遵守国家法律、法规、本协议的规定并符合社会公共政策及公共道德的要求；如有违反该等规定和要求，商户将自行独立承担所有法律责任。</div>
          <div>12. 在未经浩海通达事先书面批准的情况下，商户不得以任何形式复制、传播或向他方披露其在平台上获取的任何资料或信息。</div>
          <div>13. 为保障浩海通达利益，商户保证对其通过平台展示的信息以及信息展示行为拥有充分、合法、有效的权利，不侵犯浩海通达或第三方的著作权、专利权、商标权、商业秘密等相关知识产权以及人身权、物权其他合法权益。如果第三方声称商户通过平台进行的经营活动侵犯其知识产权或其它合法权利，并已就此对浩海通达或商户提起（包括威胁提起或可能提起）法律诉讼程序或行政执法程序（简称“侵权诉讼”），则知悉上述事项的一方应立即通知本协议对方，且浩海通达有权：（1）暂停商户在平台的经营活动及本协议项下的部分或全部服务,同时要求商户自担费用向浩海通达提供与该第三方协商、诉讼、和解所需的一切协助（包括但不限于向浩海通达提供证明侵权事实不存在的各类证据、派出人员参加协商、诉讼或会谈等）；（2）并且浩海通达有权选择与该第三方达成和解，并由商户支付和解协议所约定的全部费用以及浩海通达因侵权诉讼而遭受的全部损失或费用（包括但不限于诉讼/仲裁费、律师费、交通费、通讯费、差旅费、对第三方的损害赔偿金、行政处罚罚款、获取该服务相应许可的费用、因停止使用或修改、替换侵权诉讼所涉及的服务而遭受的损失等）。如果浩海通达选择继续参加侵权诉讼法律程序，商户应当赔偿浩海通达因侵权诉讼及履行生效法律裁判所支付的费用或遭受的损失。不论本协议是否解除或终止，本条款持续有效。</div>
          <div>14. 商户确认，其在平台披露的信息具有公开性，有可能被第三方获取和使用，并可能因第三方的不当获取或使用该等信息对商户造成损失或风险，商户承诺独立承担上述风险，不得因此为理由追究浩海通达法律责任。</div>
          <div>15. 商户理解并同意，平台相关的服务是按照现有技术和条件所能达到的现状提供的。浩海通达会尽最大努力确保服务的连贯性和安全性，但浩海通达不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。<span class="c-black">浩海通达保留不经事先通知商户，为升级、维护或其它目的暂停平台服务的全部或任何部分的权利；浩海通达保留随时停止、修改或中断平台服务而不需通知商户的权利，且浩海通达不需就此对商户或任何第三方承担责任。</span></div>
          <div><span class="c-black">16. 出于安全原因，浩海通达有权获取，且商户有义务告知浩海通达任何浩海通达有合理理由认为与保障公共安全有关的数据（包括但不限于车辆位置信息、运输路径、运输时长等数据），商户应当为浩海通达提取数据提供必要的协助（包括但不限于协助浩海通达接入政府部门规定的数据接口等）。浩海通达有权要求商户在注册平台账户时为浩海通达提供前述提取数据的协助作为注册必备条件，或在商户注册账户后的任何时候要求商户提供该等协助，且浩海通达在无法有效提取前述公共安全相关数据时有权立即停止向其提供服务或解除本协议，并不承担任何责任。</span></div>
          <div><span class="c-black">17. 商户确认其注册的平台账户为有价值资源，不应被无理闲置。如果商户连续六个月未使用其账户进行登录，浩海通达有权不经通知收回其账户，对其所提供的平台服务也将立即终止，商户不得以此为理由对浩海通达提出任何赔偿要求。</span></div>
          <h4>五、双方的权利</h4>
          <div>1. 浩海通达有权对商户的注册数据、服务数据及交易行为进行查阅，对不符合法律、法规或浩海通达有理由相信如果发布将给浩海通达带来任何不利影响的信息，有权单方面要求商户改正，也有权单方面采取其他限制性措施。</div>
          <div>2. 浩海通达保留在任何时候自行决定对平台及其相关功能、应用软件变更、升级的权利；浩海通达保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非浩海通达另有说明，否则仍适用本协议。平台服务功能随时可能因浩海通达的单方判断而被增加或修改，或因定期、不定期的系统维护而暂缓提供；商户在此同意在使用平台时，若因前述原因造成的信息传输或联络中的迟延、不准确、错误或疏漏等而产生的损失，浩海通达无须承担责任。</div>
          <div>3. 为维护平台交易安全，浩海通达有权对疑似高风险交易、非法交易进行监控和判断，商户应当配合浩海通达并提供浩海通达需要的协助，包括但不限于提供必要的交易材料证明等。</div>
          <div><span class="c-black">4. 商户对于任何与本协议有关的软件、应用程序等由浩海通达开发的产品的使用权均为可撤销的、非独家的、不可转让的、不可转授权的和有限的，不得对其更改、改写、进行逆向工程、反编译、解体、翻译及以其为基础创作衍生作品，商户承诺仅为履行本协议的目的而使用相关产品及其知识产权，对其不得超出本协议约定范围以外进行使用或实施任何作为或不作为的侵权；</span></div>
          <div>5. 商户应当在使用平台服务期间与浩海通达建立独家业务合作关系，在此期间不得与和浩海通达具有竞争关系的任何实体建立与本协议项下的合作事宜类似的合作关系。</div>
          <h4>六、保密</h4>
          <div> 1. 本协议内容属于商业秘密，商业秘密还包括本协议任何补充协议所述内容及在合作过程中涉及的其他秘密信息。任何一方未经另一方书面同意，均不得将本协议所涉的任何商业秘密向任何第三方披露、传播、编辑或展示。双方承诺本协议解除或终止后仍承担保密义务，保密期为本协议期限以及协议解除或终止后的三年。</div>
          <div>2. 因对方书面同意以及国家行政、司法强制行为而披露商业秘密的，披露方不承担责任；该商业秘密已为公众所知悉的，披露方不承担责任。</div>
          <h4>七、不可抗力</h4>
          <div>1. “不可抗力”是指本协议双方不能合理控制、不可预见或即使预见亦无法避免的事件，且该事件妨碍、影响或延误任何一方根据本协议履行其全部或部分义务。该事件包括但不限于政府行为、自然灾害、战争、黑客袭击或任何其它类似事件等。</div>
          <div>2. 遭受不可抗力事件的一方在向另一方提交不可抗力事件的书面证明后，可暂时中止履行本协议项下的义务直至不可抗力事件的影响消除为止，并且无需为此而承担违约责任。但该方应尽最大努力克服该事件，减轻其负面影响。</div>
          <div>3.如不可抗力事件影响任何一方履行本协议项下义务的时间持续超过20天或累计超过30天，双方应就是否继续履行本协议进行协商，如不能达成一致意见，任何一方有权以书面通知方式提前终止本协议。</div>
          <h4>八、违约责任和免责条款</h4>
          <div>1. 商户违反本协议约定的任何义务、承诺或保证的，浩海通达有权根据违约情况要求商户停止违约行为、采取补救措施、继续履行义务或者根据违约情况采取删除信息、公布违约行为、纠正违约行为、中止或终止对商户提供的部分或全部服务或者终止协议，或者采取包括删除商户账户信息在内其他相关措施。因商户违反本协议造成浩海通达损失的，应当承担赔偿责任。浩海通达有权根据实际情况合并使用上述各项违约救济措施。</div>
          <div>2. 因国家法律或政策的制定、修改、废止导致任何一方的义务无法履行的，相关义务方免于 承担违约责任，但须及时通知另一方。</div>
          <div>3. 商户有义务妥善处理其与用户之间产生的纠纷，并独立承担相关法律责任，浩海通达不因 上述事由向用户或商户承担任何法律责任。浩海通达与商户之间不存在合伙、雇佣等法律 关系。</div>
          <div>4. 在服务过程中，因计算机系统故障、网络故障、通讯故障、电力故障、计算机病毒攻 击及其它非浩海通达故意造成的意外事故，致使平台不能正确、有效响应或响应延迟的， 浩海通达免于承担违约责任。</div>
          <h4>九、其它</h4>
          <div>1. 商户若有严重违反本协议行为，浩海通达有权立即关闭商户在平台上的账户，并追究商户相关责任。</div>
          <div>2. 商户发生重大事项（包括但不限于经营情况恶化、并购、重组、合并、分立、停业整顿、吊销营业执照、控股股东或实际控制人变更、重大资产转让、破产、解散、受到行政处罚以及重大法律纠纷等）时，应当及时通知浩海通达。浩海通达在接到商户有关通知或经其它渠道获悉或判断认为商户发生上述重大事项时，有权采取中止或终止服务等必要措施。如商户未能采取浩海通达认可的有效措施，浩海通达有权立即终止本协议，给浩海通达造成损失的，浩海通达有权追偿。如果浩海通达要求商户提供其经营情况资料，商户应当予以积极配合。</div>
          <div>3. 为本协议之目的，商户授予浩海通达免费使用其在浩海通达平台披露的、商户享有知识产权的文字、图片、图表、视音频文件、标识、名称等各类信息的权利。</div>
          <div>4.本协议自商户注册平台账户完成时起生效。本协议终止或解除并不意味着终止或解除前所发生的未完成交易指令的撤销，也不能消除终止或解除前所发生的交易给商户所带来的任何法律责任。</div>
          <div>5. 本协议中相关标题内容对该标题项下有关条款含义的解释不具有限制作用。</div>
          <div>6. 本协议任何条款无效或不可执行，如不影响其他条款的有效性和可执行性，其他条款应继续履行。</div>
          <div>7. 本协议的成立、生效、履行、解释及纠纷解决，均受到中华人民共和国大陆地区法律管辖。因履行本协议发生的任何争议，双方应友好协商解决。协商不成时，任何一方应向浩海通达所在地有管辖权的人民法院提起诉讼。 </div>
          <div>8. 浩海通达于商户存在过失或违约情形时部分或全部放弃本协议规定的权利的，不得视为其对商户的其他或以后同类之过失或违约行为弃权。</div>
        </div>
      </div>
      <span slot="footer" class="dialog-footer">
        <el-button type="primary" @click="agreeBtn">同意并继续</el-button>
      </span>
    </el-dialog>
  </div>
</template>
<script>
export default {
  name: 'userProtocol',
  props: {
    dialogUserProtocol: {
      type: Boolean,
      required: true
    },
    agree: Function,
  },

  data: function() {

    return {

    }
  },
  computed: {

  },
  methods: {
    agreeBtn: function() {
      this.$emit('agree');
    }
  }
}

</script>
<style scoped lang="less">
.user-protocol {
  background: #fff;
  border: 1px solid #e4e7ed;
  padding: 20px 40px;
  height: 400px;
  overflow-x: hidden;
}

.user-protocol-content {
  >div {
    text-indent: 2em;
    line-height: 20px;
  }
}

.c-black {
  color: #000;
}

</style>
